test/good/arg-copy-mutation-1.cfg.dot
digraph "arg-copy-mutation-1" {
    node [shape=box];
    subgraph "cluster_Test__test" {
        label="Test__test";
        "Test__test_142" [label="m.set(3, 3)"];
        "Test__test_143" [label="m.del(3)"];
        "Test__test_145" [label="a += 1"];
        "Test__test_147" [label="a = 42"];
        "Test__test_149" [label="let _b: Int? = m.get(3)"];
        "Test__test_151" [label="self.m.set(3, 3)",style=filled,fillcolor="#66A7DB"];
        "Test__test_142" -> "Test__test_143";
        "Test__test_143" -> "Test__test_145";
        "Test__test_145" -> "Test__test_147";
        "Test__test_147" -> "Test__test_149";
        "Test__test_149" -> "Test__test_151";
    }
    subgraph "cluster_Test__testOnce" {
        label="Test__testOnce";
        "Test__testOnce_153" [label="m.set(1, 1)"];
        "Test__testOnce_154" [label="m.set(2, 2)",style=filled,fillcolor="#66A7DB"];
        "Test__testOnce_153" -> "Test__testOnce_154";
    }
}
